hxming123456/stm32_power_measure_project/Power_measurement_self_fitting_v1.0/Power_measurement_self_fitting_v1.0/Power_measurement_self_fitting_v1.0/src/main.c
//
// This file is part of the GNU ARM Eclipse distribution.
// Copyright (c) 2014 Liviu Ionescu.
//

// ----------------------------------------------------------------------------

#include <stdio.h>
#include <stdlib.h>
#include "stm32f10x.h"
#include "diag/Trace.h"
#include "bsp_usart.h"
#include "bsp_tim.h"
#include "Data_pool.h"
#include "iic_2864_operate.h"
#include "Fitting_method.h"
#include "bsp_internal_flash.h"
#include "lcd_show_content.h"
#include "WrRe_coe_from_flash.h"
#include "Clib.h"
// ----------------------------------------------------------------------------
//
// Standalone STM32F1 empty sample (trace via DEBUG).
//
// Trace support is enabled by adding the TRACE macro definition.
// By default the trace messages are forwarded to the DEBUG output,
// but can be rerouted to any device or completely suppressed, by
// changing the definitions required in system/src/diag/trace_impl.c
// (currently OS_USE_TRACE_ITM, OS_USE_TRACE_SEMIHOSTING_DEBUG/_STDOUT).
//

// ----- main() ---------------------------------------------------------------

// Sample pragmas to cope with warnings. Please note the related line at
// the end of this function, used to pop the compiler diagnostics status.
//#pragma GCC diagnostic push
//#pragma GCC diagnostic ignored "-Wunused-parameter"
//#pragma GCC diagnostic ignored "-Wmissing-declarations"
//#pragma GCC diagnostic ignored "-Wreturn-type"

ErrorStatus HSEStartUpStatus;



uint8_t key_status = 1;
uint8_t key_backup = 1;
uint32_t down_time = 0;
uint32_t up_time = 0;
uint8_t relay_sta = 1;
uint32_t external_wait_flag = 0;

uint8_t operate_mode = 0;
uint8_t self_ad_ok_flag = 0;
uint8_t external_ad_ok_flag = 0;

GPIO_TypeDef* ch_io[16] = {GPIOA,GPIOC,GPIOC,GPIOB,GPIOB,GPIOB,GPIOB,GPIOB,GPIOB,GPIOC,GPIOC,GPIOA,GPIOA,GPIOA,GPIOA,GPIOA};
uint16_t	ch_pin[16] = {GPIO_Pin_8,GPIO_Pin_7,GPIO_Pin_6,GPIO_Pin_15,GPIO_Pin_14,GPIO_Pin_13,GPIO_Pin_12,GPIO_Pin_1,
						  GPIO_Pin_0,GPIO_Pin_5,GPIO_Pin_4,GPIO_Pin_7,GPIO_Pin_6,GPIO_Pin_5,GPIO_Pin_4,GPIO_Pin_1};

double self_adjust_coea_p = 0;
double self_adjust_coeb_p = 0;
double self_adjust_coer_p = 0;

double self_adjust_coea_i = 0;
double self_adjust_coeb_i = 0;
double self_adjust_coer_i = 0;

double external_adjust_coea_p = 0;
double external_adjust_coeb_p = 0;
double external_adjust_coer_p = 0;

double external_adjust_coea_i = 0;
double external_adjust_coeb_i = 0;
double external_adjust_coer_i = 0;

void system_clk_init(void)
{
	RCC_DeInit();

	RCC_HSEConfig(RCC_HSE_ON);

	HSEStartUpStatus = RCC_WaitForHSEStartUp();

	if(HSEStartUpStatus)
	{
		RCC_HCLKConfig(RCC_SYSCLK_Div1);
		RCC_PCLK2Config(RCC_HCLK_Div1);
		RCC_PCLK1Config(RCC_HCLK_Div2);
	}

	RCC_PLLConfig(RCC_PLLSource_HSE_Div1,RCC_PLLMul_9);
	RCC_PLLCmd(ENABLE);

    while (RCC_GetFlagStatus(RCC_FLAG_PLLRDY) == RESET)
    {
    }

	RCC_SYSCLKConfig(RCC_SYSCLKSource_PLLCLK);

    while(RCC_GetSYSCLKSource() != 0x08)
    {
    }
}

void more_relay_pin_init(GPIO_TypeDef *GPIOx,uint16_t pin)
{
#if 1
	GPIO_InitTypeDef GPIO_InitStructure;

	GPIO_InitStructure.GPIO_Pin = pin;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
	GPIO_Init(GPIOx, &GPIO_InitStructure);
#endif
}

void load_relay_pin_init(void)
{
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOA,ENABLE);
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOB,ENABLE);
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOC,ENABLE);

#if 1
	more_relay_pin_init(GPIOA,GPIO_Pin_8);//CHO
	more_relay_pin_init(GPIOC,GPIO_Pin_7);
	more_relay_pin_init(GPIOC,GPIO_Pin_6);
	more_relay_pin_init(GPIOB,GPIO_Pin_15);
	more_relay_pin_init(GPIOB,GPIO_Pin_14);
	more_relay_pin_init(GPIOB,GPIO_Pin_13);
	more_relay_pin_init(GPIOB,GPIO_Pin_12);
	more_relay_pin_init(GPIOB,GPIO_Pin_1);
	more_relay_pin_init(GPIOB,GPIO_Pin_0);
	more_relay_pin_init(GPIOC,GPIO_Pin_5);
	more_relay_pin_init(GPIOC,GPIO_Pin_4);
	more_relay_pin_init(GPIOA,GPIO_Pin_7);
	more_relay_pin_init(GPIOA,GPIO_Pin_6);
	more_relay_pin_init(GPIOA,GPIO_Pin_5);
	more_relay_pin_init(GPIOA,GPIO_Pin_4);
	more_relay_pin_init(GPIOA,GPIO_Pin_1);//CH15
#endif

	//more_relay_pin_init(GPIOA,GPIO_Pin_12);
	//GPIO_SetBits(GPIOA,GPIO_Pin_12);
}


void source_relay_pin_init(void)
{

	GPIO_InitTypeDef GPIO_InitStructure;

	RCC_APB2PeriphClockCmd(RCC_APB2Periph_GPIOC,ENABLE);

	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_0;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_Out_PP;
	GPIO_Init(GPIOC, &GPIO_InitStructure);

	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_1;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPU;
	GPIO_Init(GPIOC, &GPIO_InitStructure);

	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_2;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPU;
	GPIO_Init(GPIOC, &GPIO_InitStructure);

	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_3;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPU;
	GPIO_Init(GPIOC, &GPIO_InitStructure);
}

uint32_t Check_data_is_error(uint8_t *data,uint32_t len)
{
	uint32_t sum_data = 0;
	uint32_t i = 0;
	uint32_t ret_count = 0;
	uint32_t ret_data = data[23];

	if(len != 24)
	{
		return 0;
	}

	if(*data != 0x55)
	{
		return data[0];
	}

	if((data[20]&0x70) <0x70)
	{
		return data[20];
	}

	for(i=2;i<23;i++)
	{
		sum_data += data[i];
	}

	ret_count = ((sum_data & 0x000000ff));
	//Debug_usart_write(&ret_count,4,'Y');
	//Debug_usart_write(&ret_data,4,'Y');
	if(ret_count==ret_data)
	{
		//Debug_usart_write("check 7766 data ok\r\n",20,INFO_DEBUG);
		return 1;
	}
	else
	{
		//Debug_usart_write("check 7766 data nok\r\n",21,INFO_DEBUG);
		return 0;
	}
}

uint32_t Get_6530_pvi(double *p,double *v,double *i)
{
	uint8_t p_6530[10] = {0};
	uint8_t v_6530[10] = {0};
	uint8_t i_6530[10] = {0};

	uint32_t p_len = 0;
	uint32_t v_len = 0;
	uint32_t i_len = 0;

	uint8_t cnt = 0;

	uint8_t debug = 0;

	uint8_t i_tmp = 'i';
	uint8_t v_tmp = 'v';
	uint8_t p_tmp = 'p';

	uint8_t read_outtime = 0;


