hxming123456/stm32_power_measure_project/Power_measurement_self_fitting_v1.0/Power_measurement_self_fitting_v1.0/Power_measurement_self_fitting_v1.0/src/main.c
	for(cnt=0;cnt<3;cnt++)
	{
		initDataPool(&ac6530rx);
		initDataPool(&externalrx);
		External_usart_write(&i_tmp,1);
		//AC6530_usart_write(&i_tmp,1);
		count_time_flag = 0;
		while(1)
		{
			i_len = pool_recv_one_command(&externalrx,i_6530,10,EXTERNAL_WAIT_TIME);
			//i_len = pool_recv_one_command(&ac6530rx,i_6530,10,AC6530_WAIT_TIME);
			if(i_len > 2)
			{
				break;
			}
			if(count_time_flag==1)
			{
				read_outtime++;
				if(read_outtime >= 3)
				{
					read_outtime = 0;
					return 0;
				}
				count_time_flag = 0;
			}
		}

		Debug_usart_write("read i over:",12,INFO_DEBUG);
		Debug_usart_write(i_6530,i_len,INFO_DEBUG);
		Debug_usart_write("\r\n",2,INFO_DEBUG);
		if(i_len > 0)
		{
			break;
		}
		if((cnt == 2) && (debug==0))
		{
			return 0;
		}
	}

	read_outtime = 0;
	for(cnt=0;cnt<3;cnt++)
	{
		initDataPool(&ac6530rx);
		//AC6530_usart_write(&v_tmp,1);
		External_usart_write(&v_tmp,1);
		count_time_flag = 0;
		while(1)
		{
			v_len = pool_recv_one_command(&externalrx,v_6530,10,EXTERNAL_WAIT_TIME);
			//v_len = pool_recv_one_command(&ac6530rx,v_6530,10,AC6530_WAIT_TIME);
			if(v_len > 2)
			{
				Debug_usart_write(v_6530,v_len,INFO_DEBUG);
				break;
			}
			if(count_time_flag==1)
			{
				read_outtime++;
				if(read_outtime >= 3)
				{
					read_outtime = 0;
					return 0;
				}
				count_time_flag = 0;
			}
		}
		Debug_usart_write("read v over:",12,INFO_DEBUG);
		Debug_usart_write(v_6530,v_len,INFO_DEBUG);
		Debug_usart_write("\r\n",2,INFO_DEBUG);
		if(v_len > 0)
		{
			break;
		}
		if((cnt == 2) && (debug==0))
		{
			return 0;
		}
	}

	read_outtime = 0;
	for(cnt=0;cnt<3;cnt++)
	{
		initDataPool(&ac6530rx);
		//AC6530_usart_write(&p_tmp,1);
		External_usart_write(&p_tmp,1);
		count_time_flag = 0;
		while(1)
		{
			//p_len = pool_recv_one_command(&ac6530rx,p_6530,10,AC6530_WAIT_TIME);
			p_len = pool_recv_one_command(&externalrx,p_6530,10,EXTERNAL_WAIT_TIME);
			if(p_len > 2)
			{
				Debug_usart_write(p_6530,p_len,INFO_DEBUG);
				break;
			}
			if(count_time_flag==1)
			{
				read_outtime++;
				if(read_outtime >= 3)
				{
					read_outtime = 0;
					return 0;
				}
				count_time_flag = 0;
			}
		}
		Debug_usart_write("read p over:",12,INFO_DEBUG);
		Debug_usart_write(p_6530,p_len,INFO_DEBUG);
		Debug_usart_write("\r\n",2,INFO_DEBUG);
		if(p_len > 0)
		{
			break;
		}
		if((cnt == 2) && (debug==0))
		{
			return 0;
		}
	}

	if(debug==0)
	{
		string_to_flodou(p,p_6530,p_len);
		string_to_flodou(v,v_6530,v_len);
		string_to_flodou(i,i_6530,i_len);
	}
	else
	{
		string_to_flodou(p,p_6530,5);
		string_to_flodou(v,v_6530,6);
		string_to_flodou(i,i_6530,3);
	}

	return 1;
}

#if 1
uint8_t Get_origin_pvi(uint8_t *data,uint32_t len,double *p,double *v,double *i)
{
	uint32_t tmp_p=0,tmp_v=0,tmp_i=0;
	uint32_t tmp = 0;

	uint32_t p_coe=0;
	uint32_t v_coe=0;
	uint32_t i_coe=0;
	uint32_t ret = 0;

	ret = Check_data_is_error(data,len);
	if(ret != 1)
	{
		return ret;
	}

	p_coe = (((data[14]<<8)|data[15])<<8)|data[16];
	v_coe = (((data[2]<<8)|data[3])<<8)|data[4];
	i_coe = (((data[8]<<8)|data[9])<<8)|data[10];

	tmp_p = (((data[17]<<8)|data[18])<<8)|data[19];
	tmp_v = (((tmp|data[5]<<8)|data[6])<<8)|data[7];
	tmp_i = (((data[11]<<8)|data[12])<<8)|data[13];

	*p = (double)(p_coe)/(tmp_p);
	*v = (double)(v_coe)/(tmp_v);
	*i = (double)(i_coe)/(tmp_i);

	return 1;
}
#endif


uint8_t Get_compute_pvi(uint8_t *data,uint32_t len,double *ret_p,double *ret_v,double *ret_i)
{
	double p=0,v=0,i=0;
	uint8_t ret = 0;

	ret = Get_origin_pvi(data,len,&p,&v,&i);
	if(ret==1)
	{
		*ret_p = p*self_adjust_coea_p+self_adjust_coeb_p;
		*ret_i = i*self_adjust_coea_i+self_adjust_coeb_i;
		*ret_v = v;
		return 1;
	}

	return ret;
}


void Debug_write_coe_info(void)
{
	uint8_t buf[10] = {0};
	double p_a = self_adjust_coea_p;
	double p_b = self_adjust_coeb_p;
	double p_r = self_adjust_coer_p;
	double i_a = self_adjust_coea_i;
	double i_b = self_adjust_coeb_i;
	double i_r = self_adjust_coer_i;

	Debug_usart_write("P_A:",4,INFO_DEBUG);
	if(p_a>0)
	{
		flodou_to_string(p_a,buf,Get_double_mantissa_len(&p_a),4);
	}
	else
	{
		p_a = -p_a;
		flodou_to_string(p_a,buf,Get_double_mantissa_len(&p_a),4);
		Debug_usart_write("-",1,INFO_DEBUG);
	}
	Debug_usart_write(buf,6,INFO_DEBUG);
	Debug_usart_write("\r\n",2,INFO_DEBUG);

	Debug_usart_write("P_B:",4,INFO_DEBUG);
	if(p_b>0)
	{
		flodou_to_string(p_b,buf,Get_double_mantissa_len(&p_b),4);
	}
	else
	{
		p_b = -p_b;
		flodou_to_string(p_b,buf,Get_double_mantissa_len(&p_b),4);
		Debug_usart_write("-",1,INFO_DEBUG);
	}
	Debug_usart_write(buf,6,INFO_DEBUG);
	Debug_usart_write("\r\n",2,INFO_DEBUG);

	Debug_usart_write("P_R:",4,INFO_DEBUG);
	if(p_r>0)
	{
		flodou_to_string(p_r,buf,Get_double_mantissa_len(&p_r),4);
	}
	else
	{
		p_r = -p_r;
		flodou_to_string(p_r,buf,Get_double_mantissa_len(&p_r),4);
		Debug_usart_write("-",1,INFO_DEBUG);
	}
	Debug_usart_write(buf,6,INFO_DEBUG);
	Debug_usart_write("\r\n",2,INFO_DEBUG);

	Debug_usart_write("I_A:",4,INFO_DEBUG);
	if(i_a>0)
	{
		flodou_to_string(i_a,buf,Get_double_mantissa_len(&i_a),4);
	}
	else
	{
		i_a = -i_a;
		flodou_to_string(i_a,buf,Get_double_mantissa_len(&i_a),4);
		Debug_usart_write("-",1,INFO_DEBUG);
	}
	Debug_usart_write(buf,6,INFO_DEBUG);
	Debug_usart_write("\r\n",2,INFO_DEBUG);

	Debug_usart_write("I_B:",4,INFO_DEBUG);
	if(i_b>0)
	{
		flodou_to_string(i_b,buf,Get_double_mantissa_len(&i_b),4);
	}
	else
	{
		i_b = -i_b;
		flodou_to_string(i_b,buf,Get_double_mantissa_len(&i_b),4);
		Debug_usart_write("-",1,INFO_DEBUG);
	}
	Debug_usart_write(buf,6,INFO_DEBUG);
	Debug_usart_write("\r\n",2,INFO_DEBUG);

	Debug_usart_write("I_R:",4,INFO_DEBUG);
	if(i_r>0)
	{
		flodou_to_string(i_r,buf,Get_double_mantissa_len(&i_r),4);
	}
	else
	{
		i_r = -i_r;
		flodou_to_string(i_r,buf,Get_double_mantissa_len(&i_r),4);
		Debug_usart_write("-",1,INFO_DEBUG);
	}
	Debug_usart_write(buf,6,INFO_DEBUG);
	Debug_usart_write("\r\n",2,INFO_DEBUG);
}

void key_operate(void)
{
	uint8_t c = 0;

	if(key_status != key_backup)   //power on-off
	{
	    if(key_status == 0)
	    {
	    	if(RELAY_CONTR_KEY_READ==0)
	    	{
		    	if(relay_sta==1)
		    		GPIO_SetBits(GPIOC,GPIO_Pin_0);
		    	else
		    		GPIO_ResetBits(GPIOC,GPIO_Pin_0);
		    	Debug_write_coe_info();
		    	relay_sta = ~relay_sta;
	    	}
	    	if(SELF_ADJUST_KEY_READ==0)
	    	{
	    		if(operate_mode != 0)
	    			operate_mode = 0;
	    		else
	    			operate_mode = SELF_ADJUST_MODE;
	    	}
	    	if(EXTERNAL_KEY_READ==0)
	    	{
	    		if(operate_mode != 0)
	    			operate_mode = 0;
	    		else
	    			operate_mode = EXTERNAL_ADJUST_MODE;
	    	}
	    }
	    key_backup = key_status;
		c = operate_mode + '0';
		Debug_usart_write("mode:",5,INFO_DEBUG);
		Debug_usart_write(&c,1,INFO_DEBUG);
		Debug_usart_write("\r\n",2,INFO_DEBUG);
		if(operate_mode==0)
		{
			iic_2864_clear_one(KEY_CHANGE);
			lcd_show_pvi_info(0,0,0);
		}
	}
	initDataPool(&cse7766rx);
}

