hxming123456/stm32_power_measure_project/Power_measurement_self_fitting_v1.0/Power_measurement_self_fitting_v1.0/Power_measurement_self_fitting_v1.0/src/main.c
	if(i_b < 0)
	{
		str_cat(send_data,str_len(send_data),(uint8_t *)"-",(uint32_t)1);
	}
	str_cat(send_data,str_len(send_data),i_b_buf,str_len(i_b_buf));
	str_cat(send_data,str_len(send_data),(uint8_t *)",",(uint32_t)1);

	str_cat(send_data,str_len(send_data),v_coe_buf,str_len(v_coe_buf));

	External_usart_write(send_data,str_len(send_data));
	External_usart_write((uint8_t *)"\r\n",2);

	Debug_usart_write(send_data,str_len(send_data),'Y');
}

int32_t Go_self_adjust(void)
{
	uint8_t ch_sta[16] = {0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0};//1 2 3 4 5 6 7 8 9 10 60 60 600 600 600 600 600 600
	//uint32_t load_size[28] = {1,2,3,4,5,6,7,8,9,10,15,60,120,600,660,720,1200,1260,1320,1800,1860,1920,2400,2460,2520,3000,3060,3160};
	uint32_t load_size[12] = {1,3,6,12,20,50,70,100,170,500,600,1000};
	//uint32_t load_size[8] = {1,6,20,70,100,500,600,1000};
	//uint32_t load_size[1] = {1};
	uint32_t load_cnt = 12;
	uint8_t i = 0,j = 0,z = 0,k = 0;
	uint32_t m = 0;
	uint8_t ret = 0;
	uint8_t data[240] = {0};
	uint8_t cnt_buf[2] = {0};
	uint8_t c = 0;

	uint8_t test_buf[20] = {0};
	uint8_t read_count = 0;

	double coea_p = 0;
	double coeb_p = 0;
	double coer_p = 0;

	double coea_i = 0;
	double coeb_i = 0;
	double coer_i = 0;

	double p_7766[28] = {0};
	double v_7766[28] = {0};
	double i_7766[28] = {0};

	double p_6530[28] = {0};
	double v_6530[28] = {0};
	double i_6530[28] = {0};

	double p_tmp_6530[10] = {0};
	double v_tmp_6530[10] = {0};
	double i_tmp_6530[10] = {0};

	double p_tmp_7766[10] = {0};
	double v_tmp_7766[10] = {0};
	double i_tmp_7766[10] = {0};

	for(i=0;i<load_cnt;i++)
	{
		change_load_size(ch_sta,load_size[i]);
		operate_ch_relay(ch_sta);
		memset(ch_sta,0x00, sizeof(ch_sta));
		memset(p_tmp_6530,0x00, sizeof(p_tmp_6530));
		memset(v_tmp_6530,0x00, sizeof(v_tmp_6530));
		memset(i_tmp_6530,0x00, sizeof(i_tmp_6530));
		memset(p_tmp_7766,0x00, sizeof(p_tmp_7766));
		memset(v_tmp_7766,0x00, sizeof(v_tmp_7766));
		memset(i_tmp_7766,0x00, sizeof(i_tmp_7766));

		while(1)
		{
			if(count_time_flag==1)
			{
				read_count++;
				if(read_count >= 5)
				{
					read_count = 0;
					break;
				}
				count_time_flag = 0;
			}
		}
		initDataPool(&cse7766rx);
		z = 0;
		k = 0;
		for(j=0;j<10;j++)
		{
			if(load_size[i] < 50)
			{
				if(Get_6530_pvi(&p_tmp_6530[j],&v_tmp_6530[j],&i_tmp_6530[j])==1)
				{
					k++;
				}
				else
				{
					p_tmp_6530[j/4] = 0;
					v_tmp_6530[j/4] = 0;
					i_tmp_6530[j/4] = 0;
				}
				Debug_usart_write("read 6530 over\r\n",16,INFO_DEBUG);
			}
			else
			{
				if(j%4==0)
				{
					if(Get_6530_pvi(&p_tmp_6530[j/4],&v_tmp_6530[j/4],&i_tmp_6530[j/4])==1)
					{
						k++;
					}
					else
					{
						p_tmp_6530[j/4] = 0;
						v_tmp_6530[j/4] = 0;
						i_tmp_6530[j/4] = 0;
					}
					Debug_usart_write("read 6530 over\r\n",16,INFO_DEBUG);
				}
			}
			if(load_size[i]>0)
			{
				count_time_flag = 0;
				while(1)
				{
					if(count_time_flag==1)
					{
						read_count++;
						if(read_count >= 10)
						{
							memset(ch_sta,0x00, sizeof(ch_sta));
							operate_ch_relay(ch_sta);
							return -3;
						}
						count_time_flag = 0;
					}
					pool_recv_one_command(&cse7766rx,&data[24*j],24,CSE_7766_POOL);
					Debug_usart_write(&data[24*j],24,CSE7766_DEBUG);
					ret = Check_data_is_error(&data[24*j],24);
					if(ret==1)
					{
						break;
					}
				}
			}
			else
			{
				pool_recv_one_command(&cse7766rx,&data[24*j],24,CSE_7766_POOL);
			}

		}

		if(k==0)
		{
			memset(ch_sta,0x00, sizeof(ch_sta));
			operate_ch_relay(ch_sta);
			return -1;
		}
		//Debug_usart_write("load_cnt:",9,INFO_DEBUG);
		//cnt_buf[0] = (i/10+'0');
		//cnt_buf[1] = (i%10+'0');
		//Debug_usart_write(cnt_buf,2,INFO_DEBUG);
		//Debug_usart_write("\r\n",2,INFO_DEBUG);

		for(j=0;j<k;j++)
		{
			p_6530[i] += p_tmp_6530[j];
			v_6530[i] += v_tmp_6530[j];
			i_6530[i] += i_tmp_6530[j];
		}


		flodou_to_string(p_6530[i],test_buf,5,4);
		Debug_usart_write(test_buf,9,TEST_DEBUG);
		Debug_usart_write("\r\n",2,TEST_DEBUG);

		p_6530[i] /= k;
		v_6530[i] /= k;
		i_6530[i] /= k;

		flodou_to_string(p_6530[i],test_buf,5,4);
		Debug_usart_write(test_buf,9,TEST_DEBUG);
		Debug_usart_write("\r\n",2,TEST_DEBUG);


		for(j=0;j<10;j++)
		{
			if(Get_origin_pvi(&data[24*j],24,&p_tmp_7766[j],&v_tmp_7766[j],&i_tmp_7766[j])==1)
			{
				z++;
			}
			else
			{
				p_tmp_7766[j] = 0;
				v_tmp_7766[j] = 0;
				i_tmp_7766[j] = 0;
			}
		}
		if(z==0)
		{
			memset(ch_sta,0x00, sizeof(ch_sta));
			operate_ch_relay(ch_sta);
			return -2;
		}
		for(j=0;j<10;j++)
		{
			p_7766[i] += p_tmp_7766[j];
			v_7766[i] += v_tmp_7766[j];
			i_7766[i] += i_tmp_7766[j];
		}

		flodou_to_string(p_7766[i],test_buf,5,4);
		Debug_usart_write(test_buf,9,TEST_DEBUG);
		Debug_usart_write("\r\n",2,TEST_DEBUG);

		p_7766[i] /= z;
		v_7766[i] /= z;
		i_7766[i] /= z;

		flodou_to_string(p_7766[i],test_buf,5,4);
		Debug_usart_write(test_buf,9,TEST_DEBUG);
		Debug_usart_write("\r\n\r\n",4,TEST_DEBUG);

		if(8*i < 100)
		{
			lcd_change_percent_info(8*i);
		}
	}
	c = i + '0';
	Debug_usart_write(&c,1,INFO_DEBUG);
	lcd_change_percent_info(100);
	Get_coe_a_b_r(p_7766,p_6530,28,&coea_p,&coeb_p,&coer_p);
	Get_coe_a_b_r(i_7766,i_6530,28,&coea_i,&coeb_i,&coer_i);

	if((coer_p > 0.9) && (coer_i > 0.9))
	{
		self_adjust_coea_p = coea_p;
		self_adjust_coeb_p = coeb_p;
		self_adjust_coer_p = coer_p;
		self_adjust_coea_i = coea_i;
		self_adjust_coeb_i = coeb_i;
		self_adjust_coer_i = coer_i;
		write_coe_from_flash();
		ret = 1;
	}

	lcd_show_coe_abr_info(coea_p,coeb_p,coer_p);

	memset(ch_sta,0x00, sizeof(ch_sta));
	operate_ch_relay(ch_sta);
	if(ret)
	{
		return 1;
	}

	return 0;
}

int32_t Go_external_adjust(void)
{
	uint8_t ad_sta = EXTERNAL_START;

	uint8_t ch_sta[16] = {0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0};//1 2 3 4 5 6 7 8 9 10 60 60 600 600 600 600 600 600
	//uint32_t load_size[28] = {1,2,3,4,5,6,7,8,9,10,15,60,120,600,660,720,1200,1260,1320,1800,1860,1920,2400,2460,2520,3000,3060,3160};
	uint32_t load_size[12] = {1,3,6,12,20,50,70,100,170,500,600,1000};
	uint32_t load_cnt = 12;
	uint8_t read_count = 0;
	uint8_t read_c76_count = 0;
	uint8_t err_cnt = 0;
	uint32_t len = 0;

	uint8_t c  = 0;
	uint8_t ret = 0;
	uint8_t i = 0,j = 0,k = 0;
	uint8_t m = 0;
	uint8_t self_buf[240] = {0};
	uint8_t exter_buf[50] = {0};

	uint8_t test_buf[20] = {0};
	uint8_t test_buf_b[10] = {0};

