hxming123456/stm32_power_measure_project/Power_measurement_self_fitting_v1.0/Power_measurement_self_fitting_v1.0/Power_measurement_self_fitting_v1.0/src/main.c
	double ex_coea_p = 0;
	double ex_coeb_p = 0;
	double ex_coer_p = 0;

	double ex_coea_i = 0;
	double ex_coeb_i = 0;
	double ex_coer_i = 0;

	double self_p[28] = {0};
	double self_v[28] = {0};
	double self_i[28] = {0};

	double exter_p[28] = {0};
	double exter_v[28] = {0};
	double exter_i[28] = {0};

	double self_p_tmp[10] = {0};
	double self_v_tmp[10] = {0};
	double self_i_tmp[10] = {0};

	count_time_flag = 0;
	if(ad_sta==EXTERNAL_START)
	{
		External_usart_write((uint8_t *)"AT+C76START\r\n",13);
		Debug_usart_write((uint8_t *)"AT+C76START\r\n",13,INFO_DEBUG);
		while(1)
		{

			len = pool_recv_one_command(&externalrx,exter_buf,6,EXTERNAL_POOL);
			if(len > 0)
			{
				Debug_usart_write((uint8_t *)"AT+C76START Recv:",17,INFO_DEBUG);
				Debug_usart_write(exter_buf,len,INFO_DEBUG);
				Debug_usart_write((uint8_t *)"\r\n",2,INFO_DEBUG);
				if(strncmp((const char *)exter_buf,(const char *)"\r\nOK",(size_t)4)==0)
				{
					err_cnt = 0;
					ad_sta++;
					break;
				}
				else
				{
					if(err_cnt < 3)
					{
						External_usart_write((uint8_t *)"AT+C76START\r\n",13);
						Debug_usart_write((uint8_t *)"AT+C76START\r\n",13,INFO_DEBUG);
						err_cnt++;
					}
					else
					{
						return -3;
					}
				}
			}

			if(count_time_flag==1)
			{
				read_count++;
				if(read_count >= 3)
				{
					read_count = 0;
					Debug_usart_write("recv c76 outtime\r\n",18,INFO_DEBUG);
					count_time_flag = 0;
					return -3;
				}
				count_time_flag = 0;
			}
		}
	}

	read_count = 0;

	if(ad_sta==EXTERNAL_READ_NOW)
	{
		for(i=0;i<load_cnt;i++)
		{
			change_load_size(ch_sta,load_size[i]);
			operate_ch_relay(ch_sta);
			memset(ch_sta,0x00, sizeof(ch_sta));
			//memset(self_p,0x00, sizeof(self_p));
			//memset(self_v,0x00, sizeof(self_v));
			//memset(self_i,0x00, sizeof(self_i));
			memset(self_buf,0x00, sizeof(self_buf));
			pool_recv_one_command(&externalrx,exter_buf,50,EXTERNAL_POOL);

			k = 0;
			j = 0;
			read_c76_count = 0;
			external_wait_flag = 0;
			while(1)
			{
				Debug_usart_write("wait chx change\r\n",17,'Y');
				if(external_wait_flag==1)
				{
					read_count++;
					if(read_count >= 1)
					{
						read_count = 0;
						break;
					}
					external_wait_flag = 0;
				}
			}

			initDataPool(&externalrx);
			External_usart_write((uint8_t *)"AT+C76CAPTURE\r\n",15);
			Debug_usart_write((uint8_t *)"AT+C76CAPTURE\r\n",15,'Y');
			while(1)
			{
				memset(exter_buf,0x00, sizeof(exter_buf));
				len = pool_recv_one_command(&externalrx,exter_buf,6,EXTERNAL_POOL);
				if(len > 0)
				{
					Debug_usart_write((uint8_t *)"AT+C76CAPTURE Recv:",19,INFO_DEBUG);
					Debug_usart_write(exter_buf,len,INFO_DEBUG);
					Debug_usart_write((uint8_t *)"\r\n",2,INFO_DEBUG);
					//if(strncmp((const char *)exter_buf,(const char *)"\r\nOK",(size_t)4)==0)
					if(exter_buf[2]=='O' && exter_buf[3]=='K')
					{
						err_cnt = 0;
						break;
					}
					else
					{
						if(err_cnt < 3)
						{
							initDataPool(&externalrx);
							External_usart_write((uint8_t *)"AT+C76CAPTURE\r\n",13);
							Debug_usart_write((uint8_t *)"AT+C76CAPTURE\r\n",13,INFO_DEBUG);
							err_cnt++;
						}
						else
						{
							return -3;
						}
					}
				}

				if(count_time_flag==1)
				{
					read_count++;
					if(read_count >= 3)
					{
						read_count = 0;
						Debug_usart_write("recv c76 outtime\r\n",18,INFO_DEBUG);
						count_time_flag = 0;
						return -3;
					}
					count_time_flag = 0;
				}
			}

			initDataPool(&cse7766rx);
			//initDataPool(&externalrx);
			count_time_flag = 0;
			while(1)
			{
				if(load_size[i] > 0)
				{
					read_count = 0;
					while(1)
					{
						if(count_time_flag==1)
						{
								read_count++;
								if(read_count >= 10)
								{
									Debug_usart_write("read 7766 error\r\n",17,INFO_DEBUG);
									memset(ch_sta,0x00, sizeof(ch_sta));
									operate_ch_relay(ch_sta);
									count_time_flag = 0;
									return -1;
								}
								count_time_flag = 0;
						}
						pool_recv_one_command(&cse7766rx,&self_buf[24*j],24,CSE_7766_POOL);
						ret = Check_data_is_error(&self_buf[24*j],24);
						if(ret==1)
						{
							j++;
							if(j==5)
							{
								break;
							}
							count_time_flag = 0;
						}
						else
						{
							memset(&self_buf[24*j],0x00,24);
						}
					}
				}
				memset(exter_buf,0x00, sizeof(exter_buf));
				len = pool_recv_one_command(&externalrx,exter_buf,50,EXTERNAL_POOL);
				if(len > 0)
				{
					Debug_usart_write("recv c76 pvi:",13,INFO_DEBUG);
					Debug_usart_write(exter_buf,len,INFO_DEBUG);
					Debug_usart_write("\r\n",2,INFO_DEBUG);
					break;
				}
				if(count_time_flag==1)
				{
					read_c76_count++;
					if(read_c76_count >= 15)
					{
						memset(ch_sta,0x00, sizeof(ch_sta));
						operate_ch_relay(ch_sta);
						count_time_flag = 0;
						return -2;
					}
					count_time_flag = 0;
				}
			}

			for(m=0;m<j;m++)
			{
				if(Get_origin_pvi(&self_buf[24*m],24,&self_p_tmp[m],&self_v_tmp[m],&self_i_tmp[m])==1)
				{
					k++;
				}
				else
				{
					self_p_tmp[m] = 0;
					self_v_tmp[m] = 0;
					self_i_tmp[m] = 0;
				}
			}
			if(k==0)
			{
				return -1;
			}
			for(m=0;m<j;m++)
			{
				self_p[i] += self_p_tmp[m];
				self_v[i] += self_v_tmp[m];
				self_i[i] += self_i_tmp[m];

				flodou_to_string(self_p_tmp[m],test_buf,5,4);
				Debug_usart_write(test_buf,10,TEST_DEBUG);
				Debug_usart_write("\r\n",2,TEST_DEBUG);
			}

			c = k + '0';
			Debug_usart_write(&c,1,TEST_DEBUG);
			Debug_usart_write("\r\n",2,TEST_DEBUG);

			//flodou_to_string(self_p[i],test_buf,5,4);
			//Debug_usart_write(test_buf,10,TEST_DEBUG);
			//Debug_usart_write("\r\n",2,TEST_DEBUG);

			self_p[i] /= k;
			self_v[i] /= k;
			self_i[i] /= k;

			//flodou_to_string(self_p[i],test_buf,5,4);
			//Debug_usart_write(test_buf,10,TEST_DEBUG);
			//Debug_usart_write("\r\n",2,TEST_DEBUG);

			self_p[i] = self_p[i]*self_adjust_coea_p+self_adjust_coeb_p;
			self_i[i] = self_i[i]*self_adjust_coea_i+self_adjust_coeb_i;

			flodou_to_string(self_p[i],test_buf,4,4);
			Debug_usart_write(test_buf,9,TEST_DEBUG);
			Debug_usart_write("\r\n",2,TEST_DEBUG);

			if(Get_computer_external_pvi(exter_buf,len,&exter_p[i],&exter_v[i],&exter_i[i])==0)
			{
				return -4;
			}

			flodou_to_string(exter_p[i],test_buf,4,4);
			Debug_usart_write(test_buf,9,TEST_DEBUG);
			Debug_usart_write("\r\n\r\n",4,TEST_DEBUG);


			lcd_change_percent_info(100/load_cnt*i);
		}

		lcd_change_percent_info(100);
#if 1
		for(m=0;m<load_cnt;m++)
		{
			flodou_to_string(exter_p[m],test_buf,Get_double_mantissa_len(&exter_p[m]),3);
			Debug_usart_write(test_buf,9,TEST_DEBUG);
			Debug_usart_write("\r\n",2,TEST_DEBUG);
		}
		Debug_usart_write("\r\n",2,TEST_DEBUG);
		for(m=0;m<load_cnt;m++)
		{
			flodou_to_string(self_p[m],test_buf_b,Get_double_mantissa_len(&self_p[m]),3);
			Debug_usart_write(test_buf_b,9,TEST_DEBUG);
			Debug_usart_write("\r\n",2,TEST_DEBUG);
		}
		Debug_usart_write("\r\n",2,TEST_DEBUG);
		for(m=0;m<load_cnt;m++)
		{
			flodou_to_string(exter_i[m],test_buf,Get_double_mantissa_len(&exter_i[m]),3);
			Debug_usart_write(test_buf,9,TEST_DEBUG);
			Debug_usart_write("\r\n",2,TEST_DEBUG);
		}

		Debug_usart_write("\r\n",2,TEST_DEBUG);

		for(m=0;m<load_cnt;m++)
		{
			flodou_to_string(self_i[m],test_buf_b,Get_double_mantissa_len(&self_i[m]),3);
			Debug_usart_write(test_buf_b,9,TEST_DEBUG);
			Debug_usart_write("\r\n",2,TEST_DEBUG);
		}

		Debug_usart_write("\r\n",2,TEST_DEBUG);
#endif
		Get_coe_a_b_r(exter_p,self_p,load_cnt,&ex_coea_p,&ex_coeb_p,&ex_coer_p);
		Get_coe_a_b_r(exter_i,self_i,load_cnt,&ex_coea_i,&ex_coeb_i,&ex_coer_i);

		if((ex_coer_p > 0.9) && (ex_coer_i > 0.9))
		{
			Send_result_to_c76(1,ex_coea_p,ex_coeb_p,ex_coea_i,ex_coeb_i,0);
			ret = 1;
		}
		else
		{
			Send_result_to_c76(0,ex_coea_p,ex_coeb_p,ex_coea_i,ex_coeb_i,0);
		}
		ret = 0;
	}


	lcd_show_coe_abr_info(ex_coea_p,ex_coeb_p,ex_coer_i);
	while(1)
	{
		len = pool_recv_one_command(&externalrx,test_buf,50,EXTERNAL_POOL);
		if(len>0)
		{
			Debug_usart_write("c76 adj ret:",12,TEST_DEBUG);
			Debug_usart_write(test_buf,len,TEST_DEBUG);
			Debug_usart_write("\r\n",2,TEST_DEBUG);
			break;
		}
		if(count_time_flag==1)
		{
			read_count++;
			if(read_count >= 5)
			{
				memset(ch_sta,0x00, sizeof(ch_sta));
				operate_ch_relay(ch_sta);
				count_time_flag = 0;
				return -1;
			}
			count_time_flag = 0;
		}
	}


	memset(ch_sta,0x00, sizeof(ch_sta));
	operate_ch_relay(ch_sta);

