hxming123456/stm32_power_measure_project/Power_measurement_self_fitting_v1.0/Power_measurement_self_fitting_v1.0/Power_measurement_self_fitting_v1.0/src/main.c
	if(ret==1)
	{
		return 1;
	}

	return 0;
}

void Check_c76_fac(void)
{
	uint8_t i = 0;
	uint32_t len = 0;
	uint8_t exter_buf[10] = {0};

	len = pool_recv_one_command(&externalrx,exter_buf,50,C76_10MS_TIME);
	if(len > 0)
	{
		if(exter_buf[0]=='f')
		{
			External_usart_write((uint8_t *)"factory!",8);
			Debug_usart_write((uint8_t *)"send fac over\r\n",15,INFO_DEBUG);
		}
		Debug_usart_write("c76 start recv:",15,INFO_DEBUG);
		Debug_usart_write(exter_buf,len,INFO_DEBUG);
		Debug_usart_write("\r\n",2,INFO_DEBUG);
	}

}

void relay_test(void)
{
	//static uint8_t i = 0;
	//uint8_t ch_sta[16] = {0,0,0,0,0,0,0,0,0,0,0,0,0,0,0,0};
#if 0
	ch_sta[i] = 1;
	//change_load_size(ch_sta,load_size[i]);
	operate_ch_relay(ch_sta);
	i++;
	if(i==8)
	{
		i = 0;
	}
	//AC6530_usart_write((uint8_t *)"MEASure:CURRent:AC?\r\n",21);
	//i_len = pool_recv_one_command(&ac6530rx,i_6530,200,AC_6530_POOL);
	//Debug_usart_write(i_6530,i_len,INFO_DEBUG);
#endif
	AC6530_usart_write((uint8_t *)"factory?",8);
	External_usart_write((uint8_t *)"factory?",8);
}

int main()
{
	//double x[11] = {0.226856,0.444463,2.163232,2.377381,2.589446,4.273389,4.493904,
	//				6.365462,6.563147,8.465073,10.510610};
	//double y[11] = {0.26,0.47,2.24, cdww2.46,2.68,4.4,4.64,6.58,6.67,8.71,10.84};

	double p=0,v=0,i=0;
	uint32_t len = 0;

	uint8_t data[500] = {0};
	uint8_t err_code[2] = {0};
	uint8_t ret = 0;
	int32_t ad_ret = 0;
	uint8_t exce_cnt = 0;
	uint8_t noadj_cnt = 0;
	uint8_t cycle_cnt = 0;

	system_clk_init();

	CSE7766_usart_init();
	AC6530_usart_init();
	External_usart_init();
	Debug_usart_init();

	source_relay_pin_init();
	load_relay_pin_init();
	tim_init();
	initDataPool(&cse7766rx);
	initDataPool(&ac6530rx);
	initDataPool(&externalrx);

	iic_2864_ssd1306_init();

	lcd_show_pvi_info(0,0,0);
	//write_coe_from_flash();
	while (1)
    {
#if 0
		if(count_time_flag==1)
		{
			len++;
			if(len == 1)
			{
				len = 0;
				relay_test();
			}
			count_time_flag = 0;
		}
#else
		Check_c76_fac();
		key_operate();
		if(operate_mode==SELF_ADJUST_MODE)
		{
			Debug_usart_write("Come to self_adjust mode\r\n",27,INFO_DEBUG);
			lcd_show_local_now_adjust_info();
			ad_ret = Go_self_adjust();
			if(ad_ret == 1)
			{
				Debug_usart_write("self_adjust OK\r\n",16,INFO_DEBUG);
				self_ad_ok_flag = 1;
			}
			else
			{
				if(ad_ret == -3)
				{
					Debug_usart_write("self_adjust read 7766 failed\r\n",30,INFO_DEBUG);
					lcd_show_self_read7766_error_info();
				}
				else if(ad_ret == -1)
				{
					Debug_usart_write("self_adjust read 6530 failed\r\n",30,INFO_DEBUG);
					lcd_show_self_read6530_error_info();
				}
				else if(ad_ret == -2)
				{
					Debug_usart_write("self_adjust 7766 data nok\r\n",27,INFO_DEBUG);
				}
				else if(ad_ret == 0)
				{
					Debug_usart_write("self_adjust R nok\r\n",19,INFO_DEBUG);
				}
			}
			operate_mode = 4;
		}
		else if(operate_mode==EXTERNAL_ADJUST_MODE)
		{
			if(self_ad_ok_flag==1)
			{
				Debug_usart_write("Come to external_adjust mode\r\n",30,INFO_DEBUG);
				lcd_show_exter_now_adjust_info();
				ad_ret = Go_external_adjust();
				if(ad_ret == -3)
				{
					lcd_show_recvc76_err_info();
				}
				if(ad_ret == -1)
				{
					Debug_usart_write("read 7766 err\r\n",15,INFO_DEBUG);
					lcd_show_exter_read7766_error_info();
				}
				if(ad_ret == -2)
				{
					lcd_show_exter_readc76pvi_error_info();
				}
				if(ad_ret == -4)
				{
					lcd_show_exter_c76pvi_data_error_info();
				}
			}
			else
			{
				lcd_show_local_noadjust_info();
			}
			operate_mode = 5;
		}
		else if(operate_mode==0)
		{
			if(self_ad_ok_flag)
			{
				//Debug_usart_write("come\r\n",6,'Y');
				len = pool_recv_one_command(&cse7766rx,data,500,CSE_7766_POOL);
				//Debug_usart_write("out\r\n",5,'Y');
				//Debug_usart_write(data,len,DATA_SEND_RECV_DABUG);
				if(count_time_flag==1)
				{
					//len = pool_recv_one_command(&cse7766rx,data,500,CSE_7766_POOL);
					Debug_usart_write(data,len,DATA_SEND_RECV_DABUG);
					if(len > 0)
					{
						exce_cnt = 0;
						ret = Get_compute_pvi(data,len,&p,&v,&i);
						if(ret==1)
						{
							Debug_usart_write("recv pvi ok...\r\n",16,INFO_DEBUG);
							lcd_show_pvi_info(p,v,i);
						}
						else
						{
							if(ret == 0xAA)
							{
								noadj_cnt++;
								if(noadj_cnt >= 10)
								{
									noadj_cnt = 0;
									Debug_usart_write("7766 data no adjust...\r\n",24,INFO_DEBUG);
									lcd_show_noad_info();
								}
							}
							else if(ret >= 0xF0 && ret < 0xFF)
							{
								exce_cnt++;
								if(exce_cnt >= 10)
								{
									exce_cnt = 0;
									Debug_usart_write("7766 data error code:",21,INFO_DEBUG);
									hex_to_str(err_code,ret);
									Debug_usart_write(err_code,2,INFO_DEBUG);
									Debug_usart_write("\r\n",2,INFO_DEBUG);
									lcd_show_err_code_info(ret);
								}
							}
							else
							{
								cycle_cnt++;
								if(cycle_cnt>=10)
								{
									cycle_cnt = 0;
									Debug_usart_write("adj cycle incomplete:",21,INFO_DEBUG);
									hex_to_str(err_code,ret);
									Debug_usart_write(err_code,2,INFO_DEBUG);
									Debug_usart_write("\r\n",2,INFO_DEBUG);
								}
							}
						}
					}
					else
					{
						exce_cnt++;
						if(exce_cnt >= 5)
						{
							exce_cnt = 0;
							lcd_show_no_return_info();
						}
					}
					count_time_flag = 0;
				}
				memset(data,0x00, sizeof(data));
			}
			else
			{
				ret = read_coe_from_flash();
				if(ret)
				{
					self_ad_ok_flag = 1;
					Debug_usart_write("Get coe ok\r\n",12,INFO_DEBUG);
					Debug_write_coe_info();
				}
				else
				{
					Debug_usart_write("Get coe nok\r\n",13,INFO_DEBUG);
					lcd_show_local_noadjust_info();
				}
			}
		}
#endif
    }


}

#pragma GCC diagnostic pop

// ----------------------------------------------------------------------------
